'''
    ==============================Модуль режима терминала================
    ---------------------------------------------------------------------
    Версия 0.4 для xps_astra 0.4

        Модуль работает без ключей - режим поиска файла xps на рабочем
    столе.
        Ключи:
            -i  Установка ключа с рабочего стола
            -p  Выводит паспортную информацию о системе
            -t  Сохраняет xps с рабочего стола в txt
            -h  Выводит текущее сообщение, либо html - помощь

        Мотрич Р.Д. ascent.mrd@yandex.ru 2025 г.
    ---------------------------------------------------------------------
'''